wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E/bma.c
#include "IIC_DMWZ.h"
#include "bma.h"
#include "nrf_delay.h"

bma255_t bma255;
bma255_t * p_bma255;
#define deviceaddress 0x18


unsigned char V_BMA255FIFOData_U8R[6] = {0,0,0,0,0,0}; //传感器数据存储
/*******************************************************************************
* Function Name  : LIS3DH_WriteReg
* Description  : Generic Writing function. It must be fullfilled with either
*   : I2C or I2C writing function
* Input   : Register Address, Data to be written
* Output  : None
* Return  : 0 success,1 fail
*******************************************************************************/
unsigned char I2CMasterBuffer[1];
unsigned char BMA250E_WriteReg(unsigned char WriteAddr,unsigned char  Data)
{
    unsigned char i=5;
    unsigned char I2CMasterBuffer[1];
    I2CMasterBuffer[0] = Data;
	  
	  while(i)
		{
			if(0==i2c_write(deviceaddress,WriteAddr,I2CMasterBuffer,1))
			{
			  i=0;
			  return 0;
			}
			else
			{i--;}
		}
		
		return 1;
//		i2c_write(deviceaddress,WriteAddr,I2CMasterBuffer,1);
//	  while((i2c_write(deviceaddress,WriteAddr,I2CMasterBuffer,1)==0)&&(i--));
//    return 0;//i2c_write(deviceaddress,WriteAddr,I2CMasterBuffer,1);
}
/*******************************************************************************
* Function Name  : LIS3DH_ReadReg
* Description  : Generic Reading function. It must be fullfilled with either
*   : I2C or SPI reading functions     
* Input   : Register Address
* Output  : Data REad
* Return  : 0 success,1 fail
*******************************************************************************/
unsigned char BMA250E_ReadReg(unsigned char Reg, unsigned char* Data)
{
	  unsigned char i=5;
	   while(i)
		{
			if(0==i2c_read(deviceaddress,Reg,Data,1))
			{ i=0;
			  return 0;
			}
			else
			{i--;}
		}
//	i2c_read(deviceaddress,Reg,Data,1);
    return 1;//i2c_read(deviceaddress,Reg,Data,1);
}

/*******************************************************************************
 * Description: *//**\brief
 *                      This function is used for the soft reset
 *     The soft reset register will be written with 0xB6.
 *
 *
 *
 *  \param None
 *
 *
 *
 *  \return Communication results.
 *
 *
 ******************************************************************************/
void bma250_soft_reset(void) 
   {

     BMA250E_WriteReg(BMA255_RESET_REG,0xB6);/* To reset the sensor 0xB6 value will be written */

   }
/*******************************************************************************
 * Description: *//**\brief 
 *        This function initialises the structure pointer and assigns the I2C address.
 *                              
 *
 *
 *
 *
 *  \param  bma255_t *bma255 structure pointer.
 *
 *
 *
 *  \return communication results.
 *
 *
 ******************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
int bma255_init(bma255_t *bma255)
   {
   int comres= C_Zero_BMA_U8X ;
//   unsigned char data;
      
   p_bma255 = bma255;  
   	                                                                           /* assign bma255 ptr */
//   comres = BMA250E_ReadReg(BMA255_CHIP_ID__REG,&data);

//   
//   p_bma255->chip_id = data ;                                          /* get bitslice */
//   
//   comres += BMA250E_ReadReg(BMA255_VERSION_REG,&data);

//   p_bma255->version = BMA255_GET_BITSLICE(data, BMA255_VERSION);     /* get the revision id */
   return comres;
   }

/*******************************************************************************
 * Description: *//**\brief This API is used to set Bandwidth of the sensor
 *
 *
 *
 *
 *  \param unsigned char BW
 *                       8 -> 7.81HZ
 *                       9 -> 15.63HZ
 *                      10 -> 31.25HZ
 *                      11 -> 62.50HZ
 *                      12 -> 125HZ
 *                      13 -> 250HZ
 *                      14 -> 500HZ
 *                      15 -> 1000HZ 
 *
 *
 *
 *
 *
 *  \return communication results
 *
 *
 ******************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
int bma255_set_bandwidth(unsigned char BW)
   {
   int comres = C_Zero_BMA_U8X ;
   unsigned char data;
   int Bandwidth ;
   if (p_bma255 == C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      if (p_bma255->chip_id == 0xFB)
         {
         if (BW > C_Seven_BMA_U8X && BW < C_Fifteen_BMA_U8X)
            {
            switch (BW)
               {
               case BMA255_BW_7_81HZ:
                  Bandwidth = BMA255_BW_7_81HZ;
                  
                  /*  7.81 Hz      64000 uS   */
                  break;
               case BMA255_BW_15_63HZ:
                  Bandwidth = BMA255_BW_15_63HZ;
                  
                  /*  15.63 Hz     32000 uS   */
                  break;
               case BMA255_BW_31_25HZ:
                  Bandwidth = BMA255_BW_31_25HZ;
                  
                  /*  31.25 Hz     16000 uS   */
                  break;
               case BMA255_BW_62_50HZ:
                  Bandwidth = BMA255_BW_62_50HZ;
                  
                  /*  62.50 Hz     8000 uS   */
                  break;
               case BMA255_BW_125HZ:
                  Bandwidth = BMA255_BW_125HZ;
                  
                  /*  125 Hz       4000 uS   */
                  break;
               case BMA255_BW_250HZ:
                  Bandwidth = BMA255_BW_250HZ;
                  
                  /*  250 Hz       2000 uS   */
                  break;
               case BMA255_BW_500HZ:
                  Bandwidth = BMA255_BW_500HZ;
                  
                  /*  500 Hz       1000 uS   */
                  break;
               default:
                  break;
               }
            comres = BMA250E_ReadReg(BMA255_BANDWIDTH__REG,&data);
							 //p_bma255->BMA255_BUS_READ_FUNC(p_bma255->dev_addr, BMA255_BANDWIDTH__REG, &data, C_One_BMA_U8X );
            data = BMA255_SET_BITSLICE(data, BMA255_BANDWIDTH, Bandwidth );
            comres += BMA250E_WriteReg(BMA255_BANDWIDTH__REG,data);
							 //p_bma255->BMA255_BUS_WRITE_FUNC(p_bma255->dev_addr, BMA255_BANDWIDTH__REG, &data, C_One_BMA_U8X );
            }
         else
            {
            comres = E_OUT_OF_RANGE ;
            }
         }
      else
         {
         if (BW > C_Seven_BMA_U8X && BW < C_Sixteen_BMA_U8X)
            {
            switch (BW)
               {
               case BMA255_BW_7_81HZ:
                  Bandwidth = BMA255_BW_7_81HZ;
                  
