wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E/bma.c
                  /*  7.81 Hz      64000 uS   */
                  break;
               case BMA255_BW_15_63HZ:
                  Bandwidth = BMA255_BW_15_63HZ;
                  
                  /*  15.63 Hz     32000 uS   */
                  break;
               case BMA255_BW_31_25HZ:
                  Bandwidth = BMA255_BW_31_25HZ;
                  
                  /*  31.25 Hz     16000 uS   */
                  break;
               case BMA255_BW_62_50HZ:
                  Bandwidth = BMA255_BW_62_50HZ;
                  
                  /*  62.50 Hz     8000 uS   */
                  break;
               case BMA255_BW_125HZ:
                  Bandwidth = BMA255_BW_125HZ;
                  
                  /*  125 Hz       4000 uS   */
                  break;
               case BMA255_BW_250HZ:
                  Bandwidth = BMA255_BW_250HZ;
                  
                  /*  250 Hz       2000 uS   */
                  break;
               case BMA255_BW_500HZ:
                  Bandwidth = BMA255_BW_500HZ;
                  
                  /*  500 Hz       1000 uS   */
                  break;
               case BMA255_BW_1000HZ:
                  Bandwidth = BMA255_BW_1000HZ;
                  
                  /*  1000 Hz      500 uS   */
                  break;
               default:
                  break;
               }
            comres = BMA250E_ReadReg(BMA255_BANDWIDTH__REG,&data);
							 //p_bma255->BMA255_BUS_READ_FUNC(p_bma255->dev_addr, BMA255_BANDWIDTH__REG, &data, C_One_BMA_U8X );
            data = BMA255_SET_BITSLICE(data, BMA255_BANDWIDTH, Bandwidth );
            comres += BMA250E_WriteReg(BMA255_BANDWIDTH__REG,data);
							 //p_bma255->BMA255_BUS_WRITE_FUNC(p_bma255->dev_addr, BMA255_BANDWIDTH__REG, &data, C_One_BMA_U8X );
            }
         else
            {
            comres = E_OUT_OF_RANGE ;
            }
         }
      }
   return comres;
   }
	 
	 
	 
/***************************************************************************************
 * Description: *//**\brief This API is used to set the operating Modes of the sensor
 *
 *
 *
 *
 *  \param unsigned char Mode
 *                       0 -> NORMAL
 *                       1 -> LOWPOWER1
 *                       2 -> SUSPEND
 *                       3 -> DEEP_SUSPEND
 *                       4 -> LOWPOWER2
 *                       5 -> STANDBY
 *
 *  \return communication results
 *
 *
 ***************************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
unsigned char bma255_set_mode(unsigned char Mode)
   {
   int comres=C_Zero_BMA_U8X ;
   unsigned char data1,data2;
   if (p_bma255 == C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      if (Mode < C_Six_BMA_U8X)
         {
         BMA250E_ReadReg (BMA255_MODE_CTRL_REG, &data1);
				 
         BMA250E_ReadReg(BMA255_LOW_NOISE_CTRL_REG, &data2);
         switch (Mode)
            {
            case BMA255_MODE_NORMAL:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_MODE_CTRL, C_Zero_BMA_U8X);                       
               data2  = BMA255_SET_BITSLICE(data2, BMA255_LOW_POWER_MODE, C_Zero_BMA_U8X);
               break;
            case BMA255_MODE_LOWPOWER1:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_MODE_CTRL, C_Two_BMA_U8X);
               data2  = BMA255_SET_BITSLICE(data2, BMA255_LOW_POWER_MODE, C_Zero_BMA_U8X);
               break;
            case BMA255_MODE_SUSPEND:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_MODE_CTRL, C_Four_BMA_U8X);
               data2  = BMA255_SET_BITSLICE(data2, BMA255_LOW_POWER_MODE, C_Zero_BMA_U8X);
               break;
            case BMA255_MODE_DEEP_SUSPEND:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_MODE_CTRL, C_One_BMA_U8X);
               data2  = BMA255_SET_BITSLICE(data2, BMA255_LOW_POWER_MODE, C_One_BMA_U8X);
               break;
            case BMA255_MODE_LOWPOWER2:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_MODE_CTRL, C_Two_BMA_U8X);
               data2  = BMA255_SET_BITSLICE(data2, BMA255_LOW_POWER_MODE, C_One_BMA_U8X);
               break;
            case BMA255_MODE_STANDBY:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_MODE_CTRL, C_Four_BMA_U8X);
               data2  = BMA255_SET_BITSLICE(data2, BMA255_LOW_POWER_MODE, C_One_BMA_U8X);
               break;
            default:
               break;
            }
         BMA250E_WriteReg(BMA255_MODE_CTRL_REG, data1);
		nrf_delay_ms(10);////A minimum delay of atleast 450us is required for the low power modes, as per the data sheet.
         BMA250E_WriteReg(BMA255_LOW_NOISE_CTRL_REG, data2);
         p_bma255->mode = Mode;
         }
      else
         {
         comres = E_OUT_OF_RANGE ;
         }
      }
   return comres;
   }	 
/***********************************************************************************
 * Description: *//**\brief This API is used to set Ranges(g value) of the sensor
 *
 *
 *
 *
 *  \param unsigned char Range
 *                        3 -> 2G
 *                        5 -> 4G
 *                        8 -> 8G
 *                       12 -> 16G
 *
 *  \return communication results
 *
 *
 ************************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
int bma255_set_range(unsigned char Range)
   {
   int comres=C_Zero_BMA_U8X ;
   unsigned char data1;
   if (p_bma255 == C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      if ((Range == C_Three_BMA_U8X) || (Range == C_Five_BMA_U8X) || (Range == C_Eight_BMA_U8X) || (Range == C_Twelve_BMA_U8X))
         {
         comres = BMA250E_ReadReg(BMA255_RANGE_SEL_REG,&data1);
					 //p_bma255->BMA255_BUS_READ_FUNC(p_bma255->dev_addr, BMA255_RANGE_SEL_REG, &data1, C_One_BMA_U8X );
         switch (Range)
            {
            case BMA255_RANGE_2G:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_RANGE_SEL, C_Three_BMA_U8X);
               break;
            case BMA255_RANGE_4G:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_RANGE_SEL, C_Five_BMA_U8X);
               break;
            case BMA255_RANGE_8G:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_RANGE_SEL, C_Eight_BMA_U8X);
               break;
            case BMA255_RANGE_16G:
               data1  = BMA255_SET_BITSLICE(data1, BMA255_RANGE_SEL, C_Twelve_BMA_U8X);
               break;
            default:
               break;
            }
         comres += BMA250E_WriteReg(BMA255_RANGE_SEL_REG, data1);
						//p_bma255->BMA255_BUS_WRITE_FUNC(p_bma255->dev_addr, BMA255_RANGE_SEL_REG, &data1, C_One_BMA_U8X);
         }
      else
         {
         comres = E_OUT_OF_RANGE ;
         }
      }
   return comres;
   }

/************************************************************************************
 * Description: *//**\brief This API is used to set Sleep Duration of the sensor
 *
 *
 *
 *
 *  \param unsigned char sleep_dur
 *                       5 -> 0.5MS
 *                       6 -> 1MS
 *                       7 -> 2MS
 *                       8 -> 4MS
 *                       9 -> 6MS
 *                      10 -> 10MS
 *                      11 -> 25MS
 *                      12 -> 50MS
 *                      13 -> 100MS
 *                      14 -> 500MS 
 *                      15 -> 1S  
 *
 *
 *  \return communication results
 *
 *
 **************************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
BMA255_RETURN_FUNCTION_TYPE bma255_set_sleep_dur (unsigned char sleep_dur)
   {
   unsigned char data;
   int comres = C_Zero_BMA_U8X ;
   int sleep_duration=0; 
   if (p_bma255 == C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      if (sleep_dur > C_Four_BMA_U8X && sleep_dur < C_Sixteen_BMA_U8X)
         {
         switch (sleep_dur)
            {
            case BMA255_SLEEP_DUR_0_5MS:
               sleep_duration = BMA255_SLEEP_DUR_0_5MS;
               
               /*  0.5 MS   */
               break;
            case BMA255_SLEEP_DUR_1MS:
               sleep_duration = BMA255_SLEEP_DUR_1MS;
               
               /*  1 MS  */
               break;
            case BMA255_SLEEP_DUR_2MS:
               sleep_duration = BMA255_SLEEP_DUR_2MS;
               
