wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E/bma.c
               /*  2 MS  */
               break;
            case BMA255_SLEEP_DUR_4MS:
               sleep_duration = BMA255_SLEEP_DUR_4MS;
               
               /*  4 MS   */
               break;
            case BMA255_SLEEP_DUR_6MS:
               sleep_duration = BMA255_SLEEP_DUR_6MS;
               
               /*  6 MS  */
               break;
            case BMA255_SLEEP_DUR_10MS:
               sleep_duration = BMA255_SLEEP_DUR_10MS;
               
               /*  10 MS  */
               break;
            case BMA255_SLEEP_DUR_25MS:
               sleep_duration = BMA255_SLEEP_DUR_25MS;
               
               /*  25 MS  */
               break;
            case BMA255_SLEEP_DUR_50MS:
               sleep_duration = BMA255_SLEEP_DUR_50MS;
               
               /*  50 MS   */
               break;
            case BMA255_SLEEP_DUR_100MS:
               sleep_duration = BMA255_SLEEP_DUR_100MS;
               
               /*  100 MS  */
               break;
            case BMA255_SLEEP_DUR_500MS:
               sleep_duration = BMA255_SLEEP_DUR_500MS;
               
               /*  500 MS   */
               break;
            case BMA255_SLEEP_DUR_1S:
               sleep_duration = BMA255_SLEEP_DUR_1S;
               
               /*  1 SECS   */
               break;
            default:
               break;
            }
         //SLEEP DURATION
         comres =BMA250E_ReadReg(BMA255_SLEEP_DUR__REG, &data);
         data = BMA255_SET_BITSLICE(data, BMA255_SLEEP_DUR, sleep_duration);
         comres =BMA250E_WriteReg(BMA255_SLEEP_DUR__REG, data);
         }
      else
         {
         comres = E_OUT_OF_RANGE ;
         }
      }
   return comres;
   }
	 
	/*******************************************************************************
 * Description: *//**\brief This API Reads interrupt status 2 register byte 
 *                          from location 0Ah
 *
 *
 *
 *
 *  \param unsigned char * status_2 : Address of status 2 register
 *
 *
 *
 *  \return Result of bus communication function
 *
 *
 ******************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
int bma255_get_interrupt_status2(unsigned char * status_2)
   {
   int comres = C_Zero_BMA_U8X;
   if (p_bma255 == C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      comres =BMA250E_ReadReg(BMA255_STATUS2_REG, status_2);
      }
   return comres;
   }
	 
/****************************************************************************************
 * Description: *//**\brief This API is used to set interrupt enable bits of the sensor
 *
 *
 *
 *
 *  \param unsigned char InterruptType , unsigned char value
 *                        0 -> Low_G_Interrupt
 *                        1 -> High_G_X_Interrupt
 *                        2 -> High_G_Y_Interrupt
 *                        3 -> High_G_Z_Interrupt
 *                        4 -> DATA_EN
 *                        5 -> Slope_X_Interrupt
 *                        6 -> Slope_Y_Interrupt 
 *                        7 -> Slope_Z_Interrupt
 *                        8 -> Single_Tap_Interrupt
 *                        9 -> Double_Tap_Interrupt
 *                       10 -> Orient_Interrupt
 *                       11 -> Flat_Interrupt
 *                       
 *                       
 *
 *
 *  \return communication results
 *
 *
 ****************************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
int bma255_set_Int_Enable(unsigned char InterruptType , unsigned char value )
   {
   int comres=C_Zero_BMA_U8X;
   unsigned char data1,data2;
   if (p_bma255==C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      comres =BMA250E_ReadReg(BMA255_INT_ENABLE1_REG, &data1);
      comres =BMA250E_ReadReg(BMA255_INT_ENABLE2_REG, &data2);
      
      value = value & C_One_BMA_U8X;
      switch (InterruptType)
         {
         case BMA255_Low_G_Interrupt:
            /* Low G Interrupt  */
            data2 = BMA255_SET_BITSLICE(data2, BMA255_EN_LOWG_INT, value );
            break;
         case BMA255_High_G_X_Interrupt:
            /* High G X Interrupt */
            /* EasyCASE - */
            data2 = BMA255_SET_BITSLICE(data2, BMA255_EN_HIGHG_X_INT, value );
            break;
         case BMA255_High_G_Y_Interrupt:
            /* High G Y Interrupt */
            /* EasyCASE - */
            data2 = BMA255_SET_BITSLICE(data2, BMA255_EN_HIGHG_Y_INT, value );
            break;
         case BMA255_High_G_Z_Interrupt:
            /* High G Z Interrupt */
            /* EasyCASE - */
            data2 = BMA255_SET_BITSLICE(data2, BMA255_EN_HIGHG_Z_INT, value );
            break;
         case BMA255_DATA_EN:
            /*Data En Interrupt  */
            /* EasyCASE - */
            data2 = BMA255_SET_BITSLICE(data2, BMA255_EN_NEW_DATA_INT, value );
            break;
         case BMA255_Slope_X_Interrupt:
            /* Slope X Interrupt */
            /* EasyCASE - */
            data1 = BMA255_SET_BITSLICE(data1, BMA255_EN_SLOPE_X_INT, value );
            break;
         case BMA255_Slope_Y_Interrupt:
            /* Slope Y Interrupt */
            /* EasyCASE - */
            data1 = BMA255_SET_BITSLICE(data1, BMA255_EN_SLOPE_Y_INT, value );
            break;
         case BMA255_Slope_Z_Interrupt:
            /* Slope Z Interrupt */
            /* EasyCASE - */
            data1 = BMA255_SET_BITSLICE(data1, BMA255_EN_SLOPE_Z_INT, value );
            break;
         case BMA255_Single_Tap_Interrupt:
            /* Single Tap Interrupt */
            /* EasyCASE - */
            data1 = BMA255_SET_BITSLICE(data1, BMA255_EN_SINGLE_TAP_INT, value );
            break;
         case BMA255_Double_Tap_Interrupt:
            /* Double Tap Interrupt */
            /* EasyCASE - */
            data1 = BMA255_SET_BITSLICE(data1, BMA255_EN_DOUBLE_TAP_INT, value );
            break;
         case BMA255_Orient_Interrupt:
            /* Orient Interrupt  */
            /* EasyCASE - */
            data1 = BMA255_SET_BITSLICE(data1, BMA255_EN_ORIENT_INT, value );
            break;
         case BMA255_Flat_Interrupt:
            /* Flat Interrupt */
            /* EasyCASE - */
            data1 = BMA255_SET_BITSLICE(data1, BMA255_EN_FLAT_INT, value );
            break;
         default:
            comres = E_BMA255_OUT_OF_RANGE;
            break;
         }
      comres =BMA250E_WriteReg(BMA255_INT_ENABLE1_REG, data1);
      comres =BMA250E_WriteReg(BMA255_INT_ENABLE2_REG, data2);
      }
   return comres;
   }


unsigned char BMA250E_ReadReg_DMWZ(unsigned char Reg, unsigned char* Data,unsigned char len)
{
	return i2c_read(deviceaddress,Reg,Data,len);
}
BMA255_RETURN_FUNCTION_TYPE bma255_get_fifo_data_out_reg(unsigned char *out_reg)
   {
   unsigned char data;
   int comres = C_Zero_BMA_U8X;
   if (p_bma255==C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      //GET FIFO DATA OUTPUT REGISTER
      comres =BMA250E_ReadReg_DMWZ(BMA255_FIFO_DATA_OUTPUT_REG,&data,6);
      *out_reg = data;
      }
   return comres;
   }
	 
